app/Controllers/Admin/CarreraController.php

SELECT *
FROM `periodo_escolar`
ORDER BY `id` ASC
---
    public function agregar_horario($carrera_id)
    {
        $docenteModel = new UsuarioModel();
        $asignaturaModel = new AsignaturaModel();
        $programacionModel = new ProgramacionModel();
        $periodoEscolarModel = new PeriodoEscolarModel();

        $data['docentes'] = $docenteModel->getCarreras($carrera_id);
        $data['asignaturas'] = $asignaturaModel->getCarreras($carrera_id);
        $data['carrera_id'] = $carrera_id;
        $data['periodoescolar'] = $periodoEscolarModel->orderBy('id', 'ASC')->findAll();

SELECT *
FROM `carreras`
WHERE `carreras`.`id` = '6'
---
    public function asignaciones($carrera_id)
    {
        $carreraModel = new CarreraModel();
        $carrera = $carreraModel->find($carrera_id);