app/Models/AsignaturaModel.php

    public function getCarreras($carrera_id)
    {
        $carrerasAsignaturasModel = new CarrerasAsignaturasModel();
        $carreras = $carrerasAsignaturasModel->where('carrera', $carrera_id)->findAll();

        $asignaturas = [];
        foreach ($carreras as $carrera) {
            $asignatura = $this->find($carrera['asignatura']);
---
SELECT *
FROM `asignaturas`
WHERE `asignaturas`.`id` = '6'