app/Models/ProgramacionModel.php

    public function getAsignacionesPorCarrera($carrera_id)
    {
        // return $this->where('carrera_id', $carrera_id)->findAll();
        return $this->select('programacion.*, concat(usuarios.nombre, " ", usuarios.apaterno, " ", usuarios.amaterno) as docente, asignaturas.nombre as asignatura')
            ->join('usuarios', 'usuarios.id = programacion.docente_id', 'left')
            ->join('asignaturas', 'asignaturas.id = programacion.materia_id', 'left')
            ->where('carrera_id', $carrera_id)
            ->findAll();
---
SELECT `programacion`.*, concat(usuarios.nombre, " ", `usuarios`.`apaterno`, " ", usuarios.amaterno) as docente, `asignaturas`.`nombre` as `asignatura`
FROM `programacion`
LEFT JOIN `usuarios` ON `usuarios`.`id` = `programacion`.`docente_id`
LEFT JOIN `asignaturas` ON `asignaturas`.`id` = `programacion`.`materia_id`
WHERE `carrera_id` = '6'

    public function getAsignacionesPorDocente($docente_id)
    {
        return $this->select('programacion.*, usuarios.nombre as docente, asignaturas.nombre as asignatura, carreras.nombre as carrera')
            ->join('usuarios', 'usuarios.id = programacion.docente_id', 'left')
            ->join('asignaturas', 'asignaturas.id = programacion.materia_id', 'left')
            ->join('carreras', 'carreras.id = programacion.carrera_id', 'left')
            ->where('docente_id', $docente_id)
            ->findAll();
---
SELECT `programacion`.*, `usuarios`.`nombre` as `docente`, `asignaturas`.`nombre` as `asignatura`, `carreras`.`nombre` as `carrera`
FROM `programacion`
LEFT JOIN `usuarios` ON `usuarios`.`id` = `programacion`.`docente_id`
LEFT JOIN `asignaturas` ON `asignaturas`.`id` = `programacion`.`materia_id`
LEFT JOIN `carreras` ON `carreras`.`id` = `programacion`.`carrera_id`
WHERE `docente_id` = '28'