app/Views/admin/carreras/index.php

                    </td>
                    <td class="left">
                        <a class="btn btn-outline-primary" href="<?= base_url('admin/carreras/asignarDocentes/'.$carrera['id']); ?>"><i class="fas fa-plus"></i></a>
                        <a class="btn btn-outline-info" href="<?= base_url('admin/carreras/vdxc/'.$carrera['id']); ?>"><span class="badge text-bg-secondary"><?= count($this->docentesCarrerasModel->where('carrera', $carrera['id'])->findAll()); ?></span></a>
---
SELECT *
FROM `docentes_carreras`
WHERE `carrera` = '1'